*** Settings ***

Library    SeleniumLibrary
Test Teardown    Reset App State
Resource    Keywords_V2.resource

*** Variables ***

${URL}    http://sck-dojo.ddns.net:8000/product/list
${BROWSER}    chrome


*** Test Cases ***

การทดสอบการสั่งซื้อสินค้าของลูกค้าที่ลูกค้าชำระเงินสำเร็จ

    ค้นหาสินค้าและตรวจสอบการค้นหาว่าเป็นสินค้าที่ถูกต้องตามที่ค้นหา    Balance Training Bicycle    ฿4,314.60
	ตรวจสอบรายละเอียดสินค้าและจำนวนที่ต้องการสั่งซื้อ    Balance Training Bicycle    SportsFun    ฿4,314.60    43 Points
	ตรวจสอบตะกร้าสินค้าและการเตรียมการก่อนการชำระเงิน    Balance Training Bicycle    ฿4,314.60    43 Points
	ตรวจสอบสินค้าในหน้า CHECKOUT    ฿4,314.60    43 Points
	กรอกข้อมูลการจัดส่ง    พิสิษฐ์    วนกิจรุ่งเรือง    159/49 หมู่บ้านดลลชา ซอยสุขสวัสดิ์ 70    กรุงเทพมหานคร    เขตทุ่งครุ    ทุ่งครุ    0626752828
	เลือกวิธีการจัดส่งและ กรอกข้อมูลการชำระเงิน    พิสิษฐ์ วนกิจรุ่งเรือง    1234567891014569    11/28    589
	ตรวจสอบยอดรวมคำสั่งซื้อและแต้มที่ได้รับ    ฿4,314.60    43 Points    ฿50.00    ฿4,364.60
	กรอกรหัส OTP และ ยืนยันการชำระเงิน    ฿4,364.60    789456
	กรอก Email และเบอร์โทรศัพท์เพื่อรับการแจ้งเตือนคำสั่งซื้อ    pisit.wana@gmail.com    0626752828
